/*******************************************************************
*            数码管显示测试                                            
* ******************************************************************
* 【主芯片】：STC89SC52/STC12C5A60S2
* 【主频率】: 11.0592MHz 
*                                                                                                                               	
* 【版  本】： V1.0                                          	
* 【作  者】： stephenhugh                            	
* 【网  站】：https://rymcu.taobao.com/                              	
* 【邮  箱】：                                          	
*                                                                 	
* 【版  权】All Rights Reserved 
* 【声  明】此程序仅用于学习与参考，引用请注明版权和作者信息！
         
* 【功  能】INT0外部中断,下降沿触发实验                                                            	
*******************************************************************/
#include<reg52.h>

#define uint unsigned int
	
uint Move = 0;

void main()
{
	IT0 = 1;//设置INT0为下降沿触发方式
	EX0 = 1;//允许INT0中断
	
	EA = 1;//开全局中断
	
	while(1);
}

//INT0中断函数
void int0_r() interrupt 0
{
	P1 = ~(0x01<<Move);//进入一次中断，流动一次

	if(Move>=8) Move = 0;
	else 			  Move++;
}
