/*******************************************************************
* 运算符实例
*******************************************************************/
#include <stdio.h>

void main()	   //程序主函数入口，每个C语言程序有且只有一个
{
  int a = 10;
  int b = 5;
  int c;
  /*********************************************
  * 算术运算符实例
  **********************************************/
 printf("-----算术运算符实例----\n\n");
 printf("初始值：a=10,b=5\n\n");
 c = a + b; //a加b,并将结果赋值个变量c
 printf("a+b = %d\n",c);
 c = a - b; //a减b,并将结果赋值个变量c
 printf("a-b = %d\n",c);
 c = a * b; //a乘b,并将结果赋值个变量c
 printf("a*b = %d\n",c);
 c = a / b; //a除以b,并将结果赋值个变量c
 printf("a/b = %d\n\n",c);

 a=10;
 a++;
 printf("a=10,a++之后，a= %d\n",a);
 a=10;
 a--;
 printf("a=10,a--之后，a= %d\n\n",a);

 /*********************************************
 * 关系运算符实例
 **********************************************/
 printf("-----关系运算符实例----\n\n");
 a = 10;//改变a,b的值下面语句会输出不同结果
 b = 5;

  printf(" == 运算符实例\n\n");
  printf("初始值：a=%d,b=%d\n",a,b);
  if(a==b) //如果a等于b,执行下面{}里面的语句，否则执行else的{}里面的语句
  {
    printf("a等于b\n");
  }
  else
  {
      printf("a不等于b\n");
  }

  printf("\n < 运算符实例\n\n");
  printf("初始值：a=%d,b=%d\n",a,b);
  if(a<b) //如果a小于b,执行下面{}里面的语句，否则执行else的{}里面的语句
  {
    printf("a小于b\n");
  }
  else
  {
      printf("a不小于b\n");
  }

    printf("\n其他关系运算符情况类似！\n");
  return;
}
